src/post_tonal_overtone/org_files/multi-part-overtone-tutorial/modeling-musical-time.org
* lists of primary formal constituents
** create rhythms for event list maps 
*** all 'selections' of 4 things from 2 as durations
 #+BEGIN_SRC clojure
;;(require '[clojure.math.combinatorics :as cmb])

(cmb/selections [1 2] 4)
 #+END_SRC

 #+RESULTS:
 | 1 | 1 | 1 | 1 |
 | 1 | 1 | 1 | 2 |
 | 1 | 1 | 2 | 1 |
 | 1 | 1 | 2 | 2 |
 | 1 | 2 | 1 | 1 |
 | 1 | 2 | 1 | 2 |
 | 1 | 2 | 2 | 1 |
 | 1 | 2 | 2 | 2 |
 | 2 | 1 | 1 | 1 |
 | 2 | 1 | 1 | 2 |
 | 2 | 1 | 2 | 1 |
 | 2 | 1 | 2 | 2 |
 | 2 | 2 | 1 | 1 |
 | 2 | 2 | 1 | 2 |
 | 2 | 2 | 2 | 1 |
 | 2 | 2 | 2 | 2 |

*** creat a midi event map a la Ctford
 Examine this kind of template for creating durations and pitches.

 Start with lists of duration-lists, and then convert them to on-times.
 #+BEGIN_SRC clojure


(def event-list1
  (let [durations (cmb/selections [1 2] 4)
        times (reductions + 0 (flatten (cmb/selections [1 2] 4)))
        pitches (repeat (count times) 0)]
    (map (fn [t p] {:time t :pitch p}) times pitches)))
 #+END_SRC

 #+RESULTS:
 : #'post_tonal_overtone.core/event-list1

 #+BEGIN_SRC clojure
(count event-list1)
 #+END_SRC

 #+RESULTS:
 : 65

 #+BEGIN_SRC clojure
event-list1
 #+END_SRC

 #+COMMENT long list of ontimes
 #+RESULTS:
 | :time |  0 | :pitch | 0 |
 | :time |  1 | :pitch | 0 |
 | :time |  2 | :pitch | 0 |
 | :time |  3 | :pitch | 0 |
 | :time |  4 | :pitch | 0 |
 | :time |  5 | :pitch | 0 |
 | :time |  6 | :pitch | 0 |
 | :time |  7 | :pitch | 0 |
 | :time |  9 | :pitch | 0 |
 | :time | 10 | :pitch | 0 |
 | :time | 11 | :pitch | 0 |
 | :time | 13 | :pitch | 0 |
 | :time | 14 | :pitch | 0 |
 | :time | 15 | :pitch | 0 |
 | :time | 16 | :pitch | 0 |
 | :time | 18 | :pitch | 0 |
 | :time | 20 | :pitch | 0 |
 | :time | 21 | :pitch | 0 |
 | :time | 23 | :pitch | 0 |
 | :time | 24 | :pitch | 0 |
 | :time | 25 | :pitch | 0 |
 | :time | 26 | :pitch | 0 |
 | :time | 28 | :pitch | 0 |
 | :time | 29 | :pitch | 0 |
 | :time | 31 | :pitch | 0 |
 | :time | 32 | :pitch | 0 |
 | :time | 34 | :pitch | 0 |
 | :time | 36 | :pitch | 0 |
 | :time | 37 | :pitch | 0 |
 | :time | 38 | :pitch | 0 |
 | :time | 40 | :pitch | 0 |
 | :time | 42 | :pitch | 0 |
 | :time | 44 | :pitch | 0 |
 | :time | 46 | :pitch | 0 |
 | :time | 47 | :pitch | 0 |
 | :time | 48 | :pitch | 0 |
 | :time | 49 | :pitch | 0 |
 | :time | 51 | :pitch | 0 |
 | :time | 52 | :pitch | 0 |
 | :time | 53 | :pitch | 0 |
 | :time | 55 | :pitch | 0 |
 | :time | 57 | :pitch | 0 |
 | :time | 58 | :pitch | 0 |
 | :time | 60 | :pitch | 0 |
 | :time | 61 | :pitch | 0 |
 | :time | 63 | :pitch | 0 |
 | :time | 64 | :pitch | 0 |
 | :time | 66 | :pitch | 0 |
 | :time | 68 | :pitch | 0 |
 | :time | 70 | :pitch | 0 |
 | :time | 72 | :pitch | 0 |
 | :time | 73 | :pitch | 0 |
 | :time | 74 | :pitch | 0 |
 | :time | 76 | :pitch | 0 |
 | :time | 78 | :pitch | 0 |
 | :time | 79 | :pitch | 0 |
 | :time | 81 | :pitch | 0 |
 | :time | 83 | :pitch | 0 |
 | :time | 85 | :pitch | 0 |
 | :time | 87 | :pitch | 0 |
 | :time | 88 | :pitch | 0 |
 | :time | 90 | :pitch | 0 |
 | :time | 92 | :pitch | 0 |
 | :time | 94 | :pitch | 0 |
 | :time | 96 | :pitch | 0 |


 #+BEGIN_SRC clojure
(reductions + 0 (repeat 3 1))
 #+END_SRC

 #+RESULTS:
 | 0 | 1 | 2 | 3 |

*** ~where~ maps update-in over its argument, for a given key and update function
 #+BEGIN_SRC clojure
(defn where [k f ev-list]
 (map #(update-in % [k] f) ev-list))
 #+END_SRC

 #+RESULTS:
 : #'post_tonal_overtone.core/where

 #+BEGIN_SRC clojure
(def m {:time 0 :pitch 0})
(update-in m [:time] inc)
 #+END_SRC

 #+RESULTS:
 : #'post_tonal_overtone.core/m{:time 1, :pitch 0}

*** bpm returns a function that:
 #+BEGIN_SRC clojure
(defn bpm [beats] (fn [beat] (/ (* beat 60 1000) beats)))
 #+END_SRC

 Takes a given ~now~ timestamp?

 #+BEGIN_SRC clojure
((fn [beat] (/ (* beat 60 1000) 90)) (now))
 #+END_SRC

 #+RESULTS:
 : 953164185200000

*** how does ~partial~ work?
 #+BEGIN_SRC clojure
(partial + 10)
 #+END_SRC

 #+RESULTS:
 : #<core$partial$fn__4228 clojure.core$partial$fn__4228@616e3c0b>

 #+BEGIN_SRC clojure
((partial + 10) 10)
 #+END_SRC

 #+RESULTS:
 : 20

*** define ~from~ as a partial
 #+BEGIN_SRC clojure
(defn from [n] (partial + n))
 #+END_SRC

 #+RESULTS:
 : #'post_tonal_overtone.core/from

*** create event-list map with ~where~ and event-list template
 #+BEGIN_SRC clojure
(->> event-list1
     (where :time (comp (from (now)) (bpm 90))))
 #+END_SRC

 #+RESULTS:
 | :time | 1429747135605   | :pitch | 0 |
 | :time | 4289241408815/3 | :pitch | 0 |
 | :time | 4289241410815/3 | :pitch | 0 |
 | :time | 1429747137605   | :pitch | 0 |
 | :time | 4289241414815/3 | :pitch | 0 |
 | :time | 4289241416815/3 | :pitch | 0 |
 | :time | 1429747139605   | :pitch | 0 |
 | :time | 4289241420815/3 | :pitch | 0 |
 | :time | 1429747141605   | :pitch | 0 |
 | :time | 4289241426815/3 | :pitch | 0 |
 | :time | 4289241428815/3 | :pitch | 0 |
 | :time | 4289241432815/3 | :pitch | 0 |
 | :time | 4289241434815/3 | :pitch | 0 |
 | :time | 1429747145605   | :pitch | 0 |
 | :time | 4289241438815/3 | :pitch | 0 |
 | :time | 1429747147605   | :pitch | 0 |
 | :time | 4289241446815/3 | :pitch | 0 |
 | :time | 1429747149605   | :pitch | 0 |
 | :time | 4289241452815/3 | :pitch | 0 |
 | :time | 1429747151605   | :pitch | 0 |
 | :time | 4289241456815/3 | :pitch | 0 |
 | :time | 4289241458815/3 | :pitch | 0 |
 | :time | 4289241462815/3 | :pitch | 0 |
 | :time | 4289241464815/3 | :pitch | 0 |
 | :time | 4289241468815/3 | :pitch | 0 |
 | :time | 4289241470815/3 | :pitch | 0 |
 | :time | 4289241474815/3 | :pitch | 0 |
 | :time | 1429747159605   | :pitch | 0 |
 | :time | 4289241480815/3 | :pitch | 0 |
 | :time | 4289241482815/3 | :pitch | 0 |
 | :time | 4289241486815/3 | :pitch | 0 |
 | :time | 1429747163605   | :pitch | 0 |
 | :time | 4289241494815/3 | :pitch | 0 |
 | :time | 4289241498815/3 | :pitch | 0 |
 | :time | 4289241500815/3 | :pitch | 0 |
 | :time | 1429747167605   | :pitch | 0 |
 | :time | 4289241504815/3 | :pitch | 0 |
 | :time | 1429747169605   | :pitch | 0 |
 | :time | 4289241510815/3 | :pitch | 0 |
 | :time | 4289241512815/3 | :pitch | 0 |
 | :time | 4289241516815/3 | :pitch | 0 |
 | :time | 1429747173605   | :pitch | 0 |
 | :time | 4289241522815/3 | :pitch | 0 |
 | :time | 1429747175605   | :pitch | 0 |
 | :time | 4289241528815/3 | :pitch | 0 |
 | :time | 1429747177605   | :pitch | 0 |
 | :time | 4289241534815/3 | :pitch | 0 |
 | :time | 1429747179605   | :pitch | 0 |
 | :time | 4289241542815/3 | :pitch | 0 |
 | :time | 4289241546815/3 | :pitch | 0 |
 | :time | 1429747183605   | :pitch | 0 |
 | :time | 4289241552815/3 | :pitch | 0 |
 | :time | 4289241554815/3 | :pitch | 0 |
 | :time | 4289241558815/3 | :pitch | 0 |
 | :time | 1429747187605   | :pitch | 0 |
 | :time | 4289241564815/3 | :pitch | 0 |
 | :time | 1429747189605   | :pitch | 0 |
 | :time | 4289241572815/3 | :pitch | 0 |
 | :time | 4289241576815/3 | :pitch | 0 |
 | :time | 1429747193605   | :pitch | 0 |
 | :time | 4289241582815/3 | :pitch | 0 |
 | :time | 1429747195605   | :pitch | 0 |
 | :time | 4289241590815/3 | :pitch | 0 |
 | :time | 4289241594815/3 | :pitch | 0 |
 | :time | 1429747199605   | :pitch | 0 |

