src/post_tonal_overtone/org_files/html-versions/modeling-musical-time.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-02 Fri 15:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="b" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline29">1. lists of primary formal constituents</a>
<ul>
<li><a href="#orgheadline12">1.1. create rhythms for event list maps</a>
<ul>
<li><a href="#orgheadline1">1.1.1. all 'selections' of 4 things from 2 as durations</a></li>
<li><a href="#orgheadline2">1.1.2. creat a midi event map a la Ctford</a></li>
<li><a href="#orgheadline3">1.1.3. <code>where</code> maps update-in over its argument, for a given key and update function</a></li>
<li><a href="#orgheadline4">1.1.4. bpm returns a function that:</a></li>
<li><a href="#orgheadline5">1.1.5. how does <code>partial</code> work?</a></li>
<li><a href="#orgheadline6">1.1.6. define <code>from</code> as a partial</a></li>
<li><a href="#orgheadline7">1.1.7. create event-list map with <code>where</code> and event-list template</a></li>
<li><a href="#orgheadline8">1.1.8. thread last is the same as</a></li>
<li><a href="#orgheadline9">1.1.9. how does System/millisecond (which <code>now</code> wraps) work?</a></li>
<li><a href="#orgheadline10">1.1.10. version of ctford play function that uses sampled-piano</a></li>
<li><a href="#orgheadline11">1.1.11. play the event-list</a></li>
</ul>
</li>
<li><a href="#orgheadline28">1.2. create pitches for the event list map system</a>
<ul>
<li><a href="#orgheadline13">1.2.1. start with some kind of structure</a></li>
<li><a href="#orgheadline21">1.2.2. concatenating patterns</a></li>
<li><a href="#orgheadline25">1.2.3. pitch and scalar collection</a></li>
<li><a href="#orgheadline26">1.2.4. set theoretical constructs</a></li>
<li><a href="#orgheadline27">1.2.5. reflecting</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline44">2. using probability to control output</a>
<ul>
<li><a href="#orgheadline30">2.1. importing into overtone and clojure from .contrib</a></li>
<li><a href="#orgheadline42">2.2. in overtone</a>
<ul>
<li><a href="#orgheadline40">2.2.1. algo.chance</a></li>
<li><a href="#orgheadline41">2.2.2. overtone.algo.fn</a></li>
</ul>
</li>
<li><a href="#orgheadline43">2.3. from other clojure libraries</a></li>
</ul>
</li>
<li><a href="#orgheadline46">3. divisions and subdivisions</a>
<ul>
<li><a href="#orgheadline45">3.1. messing around with numbers</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-2">
<h2 id="orgheadline29"><span class="section-number-2">1</span> lists of primary formal constituents</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.1</span> create rhythms for event list maps</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> all 'selections' of 4 things from 2 as durations</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(require '[clojure.math.combinatorics </span><span style="color: #BFEBBF;">:as</span><span style="color: #7F9F7F;"> cmb])</span>

(<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>selections [1 2] 4)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> creat a midi event map a la Ctford</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Examine this kind of template for creating durations and pitches.
</p>

<p>
Start with lists of duration-lists, and then convert them to on-times.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">event-list1</span>
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [durations (<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>selections [1 2] 4)
        times (reductions + 0 (flatten (<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>selections [1 2] 4)))
        pitches (repeat (count times) 0)]
    (map (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [t p] {<span style="color: #BFEBBF;">:time</span> t <span style="color: #BFEBBF;">:pitch</span> p}) times pitches)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(count event-list1)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">event-list1
</pre>
</div>

<p>
#+COMMENT long list of ontimes
</p>

<div class="org-src-container">

<pre class="src src-clojure">(reductions + 0 (repeat 3 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.1.3</span> <code>where</code> maps update-in over its argument, for a given key and update function</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">where</span> [k f ev-list]
 (map #(update-in <span style="color: #DFAF8F;">%</span> [k] f) ev-list))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">m</span> {<span style="color: #BFEBBF;">:time</span> 0 <span style="color: #BFEBBF;">:pitch</span> 0})
(update-in m [<span style="color: #BFEBBF;">:time</span>] inc)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.1.4</span> bpm returns a function that:</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">bpm</span> [beats] (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [beat] (/ (* beat 60 1000) beats)))
</pre>
</div>

<p>
Takes a given <code>now</code> timestamp?
</p>

<div class="org-src-container">

<pre class="src src-clojure">((<span style="color: #F0DFAF; font-weight: bold;">fn</span> [beat] (/ (* beat 60 1000) 90)) (now))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">1.1.5</span> how does <code>partial</code> work?</h4>
<div class="outline-text-4" id="text-1-1-5">
<div class="org-src-container">

<pre class="src src-clojure">(partial + 10)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">((partial + 10) 10)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">1.1.6</span> define <code>from</code> as a partial</h4>
<div class="outline-text-4" id="text-1-1-6">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">from</span> [n] (partial + n))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">1.1.7</span> create event-list map with <code>where</code> and event-list template</h4>
<div class="outline-text-4" id="text-1-1-7">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">-&gt;&gt;</span> event-list1
     (where <span style="color: #BFEBBF;">:time</span> (comp (from (now)) (bpm 90))))
</pre>
</div>
</div>
</div>
