src/post_tonal_overtone/org_files/multi-part-overtone-tutorial/modeling-musical-time.org
*** thread last is the same as
 UNDERSTANDING THREAD LAST!! Most simply, it says, use this first
 argument as the last argument for next function

 #+BEGIN_SRC clojure
(where :time (comp (from (now)) (bpm 90)) event-list) 
 #+END_SRC

 #+RESULTS:
 | :time | 1429741821225   | :pitch | 0 |
 | :time | 4289225465675/3 | :pitch | 0 |
 | :time | 4289225467675/3 | :pitch | 0 |
 | :time | 1429741823225   | :pitch | 0 |
 | :time | 4289225471675/3 | :pitch | 0 |
 | :time | 4289225473675/3 | :pitch | 0 |
 | :time | 1429741825225   | :pitch | 0 |
 | :time | 4289225477675/3 | :pitch | 0 |
 | :time | 1429741827225   | :pitch | 0 |
 | :time | 4289225483675/3 | :pitch | 0 |
 | :time | 4289225485675/3 | :pitch | 0 |
 | :time | 4289225489675/3 | :pitch | 0 |
 | :time | 4289225491675/3 | :pitch | 0 |
 | :time | 1429741831225   | :pitch | 0 |
 | :time | 4289225495675/3 | :pitch | 0 |
 | :time | 1429741833225   | :pitch | 0 |
 | :time | 4289225503675/3 | :pitch | 0 |
 | :time | 1429741835225   | :pitch | 0 |
 | :time | 4289225509675/3 | :pitch | 0 |
 | :time | 1429741837225   | :pitch | 0 |
 | :time | 4289225513675/3 | :pitch | 0 |
 | :time | 4289225515675/3 | :pitch | 0 |
 | :time | 4289225519675/3 | :pitch | 0 |
 | :time | 4289225521675/3 | :pitch | 0 |
 | :time | 4289225525675/3 | :pitch | 0 |
 | :time | 4289225527675/3 | :pitch | 0 |
 | :time | 4289225531675/3 | :pitch | 0 |
 | :time | 1429741845225   | :pitch | 0 |
 | :time | 4289225537675/3 | :pitch | 0 |
 | :time | 4289225539675/3 | :pitch | 0 |
 | :time | 4289225543675/3 | :pitch | 0 |
 | :time | 1429741849225   | :pitch | 0 |
 | :time | 4289225551675/3 | :pitch | 0 |
 | :time | 4289225555675/3 | :pitch | 0 |
 | :time | 4289225557675/3 | :pitch | 0 |
 | :time | 1429741853225   | :pitch | 0 |
 | :time | 4289225561675/3 | :pitch | 0 |
 | :time | 1429741855225   | :pitch | 0 |
 | :time | 4289225567675/3 | :pitch | 0 |
 | :time | 4289225569675/3 | :pitch | 0 |
 | :time | 4289225573675/3 | :pitch | 0 |
 | :time | 1429741859225   | :pitch | 0 |
 | :time | 4289225579675/3 | :pitch | 0 |
 | :time | 1429741861225   | :pitch | 0 |
 | :time | 4289225585675/3 | :pitch | 0 |
 | :time | 1429741863225   | :pitch | 0 |
 | :time | 4289225591675/3 | :pitch | 0 |
 | :time | 1429741865225   | :pitch | 0 |
 | :time | 4289225599675/3 | :pitch | 0 |
 | :time | 4289225603675/3 | :pitch | 0 |
 | :time | 1429741869225   | :pitch | 0 |
 | :time | 4289225609675/3 | :pitch | 0 |
 | :time | 4289225611675/3 | :pitch | 0 |
 | :time | 4289225615675/3 | :pitch | 0 |
 | :time | 1429741873225   | :pitch | 0 |
 | :time | 4289225621675/3 | :pitch | 0 |
 | :time | 1429741875225   | :pitch | 0 |
 | :time | 4289225629675/3 | :pitch | 0 |
 | :time | 4289225633675/3 | :pitch | 0 |
 | :time | 1429741879225   | :pitch | 0 |
 | :time | 4289225639675/3 | :pitch | 0 |
 | :time | 1429741881225   | :pitch | 0 |
 | :time | 4289225647675/3 | :pitch | 0 |
 | :time | 4289225651675/3 | :pitch | 0 |
 | :time | 1429741885225   | :pitch | 0 |

*** how does System/millisecond (which ~now~ wraps) work?
 #+BEGIN_SRC clojure :results output
(let [den (now)
      dis (+ 1000 den)]
  (do (prn den)
      (prn dis)))
 #+END_SRC

 #+RESULTS:
 : 1429742420877
 : 1429742421877

*** version of ctford play function that uses sampled-piano
 #+BEGIN_SRC clojure
(defn my-ctford-play [notes] (doseq [{ms :time midi :pitch} notes] (at ms (sampled-piano (+ midi 60)))))
 #+END_SRC

 #+RESULTS:
 : #'post_tonal_overtone.core/my-ctford-play

*** play the event-list
 #+BEGIN_SRC clojure
(->> event-list1 (where :time (comp (from (now)) (bpm 420))) my-ctford-play)
 #+END_SRC

 #+RESULTS:
 : nil

** create pitches for the event list map system
*** start with some kind of structure
There are a lot of options, depending on what kind of pitch structures
you want to work with, and how you wish to represent them.

Some of the simplest things to do are just to generate lists of
possible permutations, in this case using the combinatorics library,
and specificially the selections function, because it deals well with
repetition, i.e. P and C "with replacement"
*** concatenating patterns
**** documenting the combinatorics library
 #+BEGIN_SRC clojure
cmb/assert-with-message <m> 	cmb/cartesian-product <f> 	cmb/combinations <f>
cmb/count-combinations <f> 	cmb/count-permutations <f> 	cmb/count-subsets <f>
cmb/drop-permutations <f> 	cmb/nth-combination <f> 	cmb/nth-permutation <f>
cmb/nth-subset <f> 	cmb/partitions <f> 	cmb/permutation-index <f>
cmb/permutations <f> 	cmb/selections <f> 	cmb/subsets <f>
 #+END_SRC

***** combinations
 #+BEGIN_SRC clojure
post_tonal_overtone.core> (source cmb/combinations)
(defn combinations
  "All the unique ways of taking t different elements from items"
  [items t]      
  (let [v-items (vec (reverse items))]
    (if (zero? t) (list ())
      (let [cnt (count items)]
        (cond (> t cnt) nil
              (= t 1) (for [item (distinct items)] (list item))
              (all-different? items) (if (= t cnt) 
                                        (list (seq items))
                                        (map #(map v-items %) (index-combinations t cnt))),
              :else (multi-comb items t))))))
 #+END_SRC

***** permutations
 #+BEGIN_SRC clojure
(defn permutations
  "All the distinct permutations of items, lexicographic by index 
(special handling for duplicate items)."
  [items]
  (cond
    (sorted-numbers? items) (lex-permutations items),
    
    (all-different? items)
    (let [v (vec items)]
      (map #(map v %) (lex-permutations (range (count v)))))
    
    :else
    (multi-perm items)))
 #+END_SRC

***** subsets
 #+BEGIN_SRC clojure
post_tonal_overtone.core> (source cmb/subsets)
(defn subsets
  "All the subsets of items"
  [items]
  (mapcat (fn [n] (combinations items n))
          (unchunk (range (inc (count items))))))
 #+END_SRC

***** partitions
 #+BEGIN_SRC clojure
(defn partitions
  "All the lexicographic distinct partitions of items.
    Optionally pass in :min and/or :max to specify inclusive bounds on the number of parts the items can be split into."
  [items & args]
  (cond
    (= (count items) 0) (apply partitions-H items args)
    (all-different? items) (apply partitions-H items args)
    :else (apply partitions-M items args)))
 #+END_SRC

