src/post_tonal_overtone/org_files/html-versions/modeling-musical-time.html

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">1.1.8</span> thread last is the same as</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
UNDERSTANDING THREAD LAST!! Most simply, it says, use this first
argument as the last argument for next function
</p>

<div class="org-src-container">

<pre class="src src-clojure">(where <span style="color: #BFEBBF;">:time</span> (comp (from (now)) (bpm 90)) event-list)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.1.9</span> how does System/millisecond (which <code>now</code> wraps) work?</h4>
<div class="outline-text-4" id="text-1-1-9">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">let</span> [den (now)
      dis (+ 1000 den)]
  (<span style="color: #F0DFAF; font-weight: bold;">do</span> (prn den)
      (prn dis)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">1.1.10</span> version of ctford play function that uses sampled-piano</h4>
<div class="outline-text-4" id="text-1-1-10">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">my-ctford-play</span> [notes] (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [{ms <span style="color: #BFEBBF;">:time</span> midi <span style="color: #BFEBBF;">:pitch</span>} notes] (at ms (sampled-piano (+ midi 60)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">1.1.11</span> play the event-list</h4>
<div class="outline-text-4" id="text-1-1-11">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">-&gt;&gt;</span> event-list1 (where <span style="color: #BFEBBF;">:time</span> (comp (from (now)) (bpm 420))) my-ctford-play)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">1.2</span> create pitches for the event list map system</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">1.2.1</span> start with some kind of structure</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
There are a lot of options, depending on what kind of pitch structures
you want to work with, and how you wish to represent them.
</p>

<p>
Some of the simplest things to do are just to generate lists of
possible permutations, in this case using the combinatorics library,
and specificially the selections function, because it deals well with
repetition, i.e. P and C "with replacement"
</p>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">1.2.2</span> concatenating patterns</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li><a id="orgheadline20"></a>documenting the combinatorics library<br  /><div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>assert-with-message &lt;m&gt;     <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>cartesian-product &lt;f&gt;       <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>combinations &lt;f&gt;
<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>count-combinations &lt;f&gt;      <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>count-permutations &lt;f&gt;      <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>count-subsets &lt;f&gt;
<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>drop-permutations &lt;f&gt;       <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>nth-combination &lt;f&gt;         <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>nth-permutation &lt;f&gt;
<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>nth-subset &lt;f&gt;      <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>partitions &lt;f&gt;      <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>permutation-index &lt;f&gt;
<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>permutations &lt;f&gt;    <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>selections &lt;f&gt;      <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>subsets &lt;f&gt;
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="orgheadline14"></a>combinations<br  /><div class="outline-text-6" id="text-1-2-2-1-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #7CB8BB;">post_tonal_overtone.core</span>&gt; (source <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>combinations)
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">combinations</span>
  <span style="color: #9FC59F;">"All the unique ways of taking t different elements from items"</span>
  [items t]      
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [v-items (vec (reverse items))]
    (<span style="color: #F0DFAF; font-weight: bold;">if</span> (zero? t) (list ())
      (<span style="color: #F0DFAF; font-weight: bold;">let</span> [cnt (count items)]
        (<span style="color: #F0DFAF; font-weight: bold;">cond</span> (&gt; t cnt) <span style="color: #BFEBBF;">nil</span>
              (= t 1) (<span style="color: #F0DFAF; font-weight: bold;">for</span> [item (distinct items)] (list item))
              (all-different? items) (<span style="color: #F0DFAF; font-weight: bold;">if</span> (= t cnt) 
                                        (list (seq items))
                                        (map #(map v-items <span style="color: #DFAF8F;">%</span>) (index-combinations t cnt))),
              <span style="color: #BFEBBF;">:else</span> (multi-comb items t))))))
</pre>
</div>
</div></li>

<li><a id="orgheadline15"></a>permutations<br  /><div class="outline-text-6" id="text-1-2-2-1-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">permutations</span>
  <span style="color: #9FC59F;">"All the distinct permutations of items, lexicographic by index </span>
<span style="color: #9FC59F;">(special handling for duplicate items)."</span>
  [items]
  (<span style="color: #F0DFAF; font-weight: bold;">cond</span>
    (sorted-numbers? items) (lex-permutations items),

    (all-different? items)
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [v (vec items)]
      (map #(map v <span style="color: #DFAF8F;">%</span>) (lex-permutations (range (count v)))))

    <span style="color: #BFEBBF;">:else</span>
    (multi-perm items)))
</pre>
</div>
</div></li>

<li><a id="orgheadline16"></a>subsets<br  /><div class="outline-text-6" id="text-1-2-2-1-3">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #7CB8BB;">post_tonal_overtone.core</span>&gt; (source <span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>subsets)
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">subsets</span>
  <span style="color: #9FC59F;">"All the subsets of items"</span>
  [items]
  (mapcat (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [n] (combinations items n))
          (unchunk (range (inc (count items))))))
</pre>
</div>
</div></li>

<li><a id="orgheadline17"></a>partitions<br  /><div class="outline-text-6" id="text-1-2-2-1-4">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">partitions</span>
  <span style="color: #9FC59F;">"All the lexicographic distinct partitions of items.</span>
<span style="color: #9FC59F;">    Optionally pass in </span><span style="color: #BFEBBF;">:min</span><span style="color: #9FC59F;"> and/or </span><span style="color: #BFEBBF;">:max</span><span style="color: #9FC59F;"> to specify inclusive bounds on the number of parts the items can be split into."</span>
  [items &amp; args]
  (<span style="color: #F0DFAF; font-weight: bold;">cond</span>
    (= (count items) 0) (apply partitions-H items args)
    (all-different? items) (apply partitions-H items args)
    <span style="color: #BFEBBF;">:else</span> (apply partitions-M items args)))
</pre>
</div>
</div></li>
