src/post_tonal_overtone/org_files/multi-part-overtone-tutorial/modeling-musical-time.org
***** cartesian-product
 #+BEGIN_SRC clojure
(defn cartesian-product
  "All the ways to take one item from each sequence"
  [& seqs]
  (let [v-original-seqs (vec seqs)
        step
        (fn step [v-seqs]
          (let [increment
                (fn [v-seqs]
                  (loop [i (dec (count v-seqs)), v-seqs v-seqs]
                    (if (= i -1) nil
                      (if-let [rst (next (v-seqs i))]
                        (assoc v-seqs i rst)
                        (recur (dec i) (assoc v-seqs i (v-original-seqs i)))))))]
            (when v-seqs
              (cons (map first v-seqs)
                    (lazy-seq (step (increment v-seqs)))))))]
    (when (every? seq seqs)
      (lazy-seq (step v-original-seqs)))))
 #+END_SRC

***** permutation indexing
 #+BEGIN_SRC clojure
(defn permutation-index
  "Input must be a sortable collection of items.  Returns the n such that
    (nth-permutation (sort items) n) is items."
  [items]
  (if (all-different? items)
    (permutation-index-distinct items)
    (permutation-index-duplicates items)))
 #+END_SRC

 #+BEGIN_SRC clojure
(cmb/nth-permutation '(0 1 2 3) 4)
 #+END_SRC

 #+RESULTS:
 | 0 | 3 | 1 | 2 |


 #+BEGIN_SRC clojure

 #+END_SRC
*** pitch and scalar collection
**** diatonic
In terms of scale degrees using arabic numerals 1 through 7, which
aligns most nicely with the diatonic scale
#+BEGIN_SRC clojure
(count (cmb/selections (map inc (range 7)) 3))
#+END_SRC

#+RESULTS:
: 343
**** 12-note chromatic scale
#+BEGIN_SRC clojure
(count (cmb/selections (range 12) 3))
#+END_SRC

#+RESULTS:
: 1728
