src/post_tonal_overtone/org_files/html-versions/modeling-musical-time.html

<li><a id="orgheadline18"></a>cartesian-product<br  /><div class="outline-text-6" id="text-1-2-2-1-5">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">cartesian-product</span>
  <span style="color: #9FC59F;">"All the ways to take one item from each sequence"</span>
  [&amp; seqs]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [v-original-seqs (vec seqs)
        step
        (<span style="color: #F0DFAF; font-weight: bold;">fn</span> <span style="color: #93E0E3;">step</span> [v-seqs]
          (<span style="color: #F0DFAF; font-weight: bold;">let</span> [increment
                (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [v-seqs]
                  (<span style="color: #F0DFAF; font-weight: bold;">loop</span> [i (dec (count v-seqs)), v-seqs v-seqs]
                    (<span style="color: #F0DFAF; font-weight: bold;">if</span> (= i -1) <span style="color: #BFEBBF;">nil</span>
                      (<span style="color: #F0DFAF; font-weight: bold;">if-let</span> [rst (next (v-seqs i))]
                        (assoc v-seqs i rst)
                        (<span style="color: #F0DFAF; font-weight: bold;">recur</span> (dec i) (assoc v-seqs i (v-original-seqs i)))))))]
            (<span style="color: #F0DFAF; font-weight: bold;">when</span> v-seqs
              (cons (map first v-seqs)
                    (lazy-seq (step (increment v-seqs)))))))]
    (<span style="color: #F0DFAF; font-weight: bold;">when</span> (every? seq seqs)
      (lazy-seq (step v-original-seqs)))))
</pre>
</div>
</div></li>

<li><a id="orgheadline19"></a>permutation indexing<br  /><div class="outline-text-6" id="text-1-2-2-1-6">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">permutation-index</span>
  <span style="color: #9FC59F;">"Input must be a sortable collection of items.  Returns the n such that</span>
<span style="color: #9FC59F;">    (nth-permutation (sort items) n) is items."</span>
  [items]
  (<span style="color: #F0DFAF; font-weight: bold;">if</span> (all-different? items)
    (permutation-index-distinct items)
    (permutation-index-duplicates items)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>nth-permutation '(0 1 2 3) 4)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure"></pre>
</div>
</div></li></ol></li></ol>
</div>
<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">1.2.3</span> pitch and scalar collection</h4>
<div class="outline-text-4" id="text-1-2-3">
</div><ol class="org-ol"><li><a id="orgheadline22"></a>diatonic<br  /><div class="outline-text-5" id="text-1-2-3-1">
<p>
In terms of scale degrees using arabic numerals 1 through 7, which
aligns most nicely with the diatonic scale
</p>
<div class="org-src-container">

<pre class="src src-clojure">(count (<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>selections (map inc (range 7)) 3))
</pre>
</div>
</div></li>
<li><a id="orgheadline23"></a>12-note chromatic scale<br  /><div class="outline-text-5" id="text-1-2-3-2">
<div class="org-src-container">

<pre class="src src-clojure">(count (<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>selections (range 12) 3))
</pre>
</div>
</div></li>
