src/post_tonal_overtone/org_files/multi-part-overtone-tutorial/modeling-musical-time.org
**** roman numerals as provided by overtone
#+BEGIN_SRC clojure
(count (cmb/selections [:i :ii :iii :iv :v :vi :vii] 3))
#+END_SRC

#+RESULTS:
: 343

#+RESULTS:
| :i   | :i   | :i   |
| :i   | :i   | :ii  |
| :i   | :i   | :iii |
| :i   | :i   | :iv  |
| :i   | :i   | :v   |
| :i   | :i   | :vi  |
| :i   | :i   | :vii |
| :i   | :ii  | :i   |
| :i   | :ii  | :ii  |
| :i   | :ii  | :iii |
| :i   | :ii  | :iv  |
| :i   | :ii  | :v   |
| :i   | :ii  | :vi  |
| :i   | :ii  | :vii |
| :i   | :iii | :i   |
| :i   | :iii | :ii  |
| :i   | :iii | :iii |
| :i   | :iii | :iv  |
| :i   | :iii | :v   |
| :i   | :iii | :vi  |
| :i   | :iii | :vii |
| :i   | :iv  | :i   |
| :i   | :iv  | :ii  |
| :i   | :iv  | :iii |
| :i   | :iv  | :iv  |
| :i   | :iv  | :v   |
| :i   | :iv  | :vi  |
| :i   | :iv  | :vii |
| :i   | :v   | :i   |
| :i   | :v   | :ii  |
| :i   | :v   | :iii |
| :i   | :v   | :iv  |
| :i   | :v   | :v   |
| :i   | :v   | :vi  |
| :i   | :v   | :vii |
| :i   | :vi  | :i   |
| :i   | :vi  | :ii  |
| :i   | :vi  | :iii |
| :i   | :vi  | :iv  |
| :i   | :vi  | :v   |
| :i   | :vi  | :vi  |
| :i   | :vi  | :vii |
| :i   | :vii | :i   |
| :i   | :vii | :ii  |
| :i   | :vii | :iii |
| :i   | :vii | :iv  |
| :i   | :vii | :v   |
| :i   | :vii | :vi  |
| :i   | :vii | :vii |
| :ii  | :i   | :i   |
| :ii  | :i   | :ii  |
| :ii  | :i   | :iii |
| :ii  | :i   | :iv  |
| :ii  | :i   | :v   |
| :ii  | :i   | :vi  |
| :ii  | :i   | :vii |
| :ii  | :ii  | :i   |
| :ii  | :ii  | :ii  |
| :ii  | :ii  | :iii |
| :ii  | :ii  | :iv  |
| :ii  | :ii  | :v   |
| :ii  | :ii  | :vi  |
| :ii  | :ii  | :vii |
| :ii  | :iii | :i   |
| :ii  | :iii | :ii  |
| :ii  | :iii | :iii |
| :ii  | :iii | :iv  |
| :ii  | :iii | :v   |
| :ii  | :iii | :vi  |
| :ii  | :iii | :vii |
| :ii  | :iv  | :i   |
| :ii  | :iv  | :ii  |
| :ii  | :iv  | :iii |
| :ii  | :iv  | :iv  |
| :ii  | :iv  | :v   |
| :ii  | :iv  | :vi  |
| :ii  | :iv  | :vii |
| :ii  | :v   | :i   |
| :ii  | :v   | :ii  |
| :ii  | :v   | :iii |
| :ii  | :v   | :iv  |
| :ii  | :v   | :v   |
| :ii  | :v   | :vi  |
| :ii  | :v   | :vii |
| :ii  | :vi  | :i   |
| :ii  | :vi  | :ii  |
| :ii  | :vi  | :iii |
| :ii  | :vi  | :iv  |
| :ii  | :vi  | :v   |
| :ii  | :vi  | :vi  |
| :ii  | :vi  | :vii |
| :ii  | :vii | :i   |
| :ii  | :vii | :ii  |
| :ii  | :vii | :iii |
| :ii  | :vii | :iv  |
| :ii  | :vii | :v   |
| :ii  | :vii | :vi  |
| :ii  | :vii | :vii |
| :iii | :i   | :i   |
| :iii | :i   | :ii  |
| :iii | :i   | :iii |
| :iii | :i   | :iv  |
| :iii | :i   | :v   |
| :iii | :i   | :vi  |
| :iii | :i   | :vii |
| :iii | :ii  | :i   |
| :iii | :ii  | :ii  |
| :iii | :ii  | :iii |
| :iii | :ii  | :iv  |
| :iii | :ii  | :v   |
| :iii | :ii  | :vi  |
| :iii | :ii  | :vii |
| :iii | :iii | :i   |
| :iii | :iii | :ii  |
| :iii | :iii | :iii |
| :iii | :iii | :iv  |
| :iii | :iii | :v   |
| :iii | :iii | :vi  |
| :iii | :iii | :vii |
| :iii | :iv  | :i   |
| :iii | :iv  | :ii  |
| :iii | :iv  | :iii |
| :iii | :iv  | :iv  |
| :iii | :iv  | :v   |
| :iii | :iv  | :vi  |
| :iii | :iv  | :vii |
| :iii | :v   | :i   |
| :iii | :v   | :ii  |
| :iii | :v   | :iii |
| :iii | :v   | :iv  |
| :iii | :v   | :v   |
| :iii | :v   | :vi  |
| :iii | :v   | :vii |
| :iii | :vi  | :i   |
| :iii | :vi  | :ii  |
| :iii | :vi  | :iii |
| :iii | :vi  | :iv  |
| :iii | :vi  | :v   |
| :iii | :vi  | :vi  |
| :iii | :vi  | :vii |
| :iii | :vii | :i   |
| :iii | :vii | :ii  |
| :iii | :vii | :iii |
| :iii | :vii | :iv  |
| :iii | :vii | :v   |
| :iii | :vii | :vi  |
| :iii | :vii | :vii |
| :iv  | :i   | :i   |
| :iv  | :i   | :ii  |
| :iv  | :i   | :iii |
| :iv  | :i   | :iv  |
| :iv  | :i   | :v   |
| :iv  | :i   | :vi  |
| :iv  | :i   | :vii |
| :iv  | :ii  | :i   |
| :iv  | :ii  | :ii  |
| :iv  | :ii  | :iii |
| :iv  | :ii  | :iv  |
| :iv  | :ii  | :v   |
| :iv  | :ii  | :vi  |
| :iv  | :ii  | :vii |
| :iv  | :iii | :i   |
| :iv  | :iii | :ii  |
| :iv  | :iii | :iii |
| :iv  | :iii | :iv  |
| :iv  | :iii | :v   |
| :iv  | :iii | :vi  |
| :iv  | :iii | :vii |
| :iv  | :iv  | :i   |
| :iv  | :iv  | :ii  |
| :iv  | :iv  | :iii |
| :iv  | :iv  | :iv  |
| :iv  | :iv  | :v   |
| :iv  | :iv  | :vi  |
| :iv  | :iv  | :vii |
| :iv  | :v   | :i   |
| :iv  | :v   | :ii  |
| :iv  | :v   | :iii |
| :iv  | :v   | :iv  |
| :iv  | :v   | :v   |
| :iv  | :v   | :vi  |
| :iv  | :v   | :vii |
| :iv  | :vi  | :i   |
| :iv  | :vi  | :ii  |
| :iv  | :vi  | :iii |
| :iv  | :vi  | :iv  |
| :iv  | :vi  | :v   |
| :iv  | :vi  | :vi  |
| :iv  | :vi  | :vii |
| :iv  | :vii | :i   |
| :iv  | :vii | :ii  |
| :iv  | :vii | :iii |
| :iv  | :vii | :iv  |
| :iv  | :vii | :v   |
| :iv  | :vii | :vi  |
| :iv  | :vii | :vii |
| :v   | :i   | :i   |
| :v   | :i   | :ii  |
| :v   | :i   | :iii |
| :v   | :i   | :iv  |
| :v   | :i   | :v   |
| :v   | :i   | :vi  |
| :v   | :i   | :vii |
| :v   | :ii  | :i   |
| :v   | :ii  | :ii  |
| :v   | :ii  | :iii |
| :v   | :ii  | :iv  |
| :v   | :ii  | :v   |
| :v   | :ii  | :vi  |
| :v   | :ii  | :vii |
| :v   | :iii | :i   |
| :v   | :iii | :ii  |
| :v   | :iii | :iii |
| :v   | :iii | :iv  |
| :v   | :iii | :v   |
| :v   | :iii | :vi  |
| :v   | :iii | :vii |
| :v   | :iv  | :i   |
| :v   | :iv  | :ii  |
| :v   | :iv  | :iii |
| :v   | :iv  | :iv  |
| :v   | :iv  | :v   |
| :v   | :iv  | :vi  |
| :v   | :iv  | :vii |
| :v   | :v   | :i   |
| :v   | :v   | :ii  |
| :v   | :v   | :iii |
| :v   | :v   | :iv  |
| :v   | :v   | :v   |
| :v   | :v   | :vi  |
| :v   | :v   | :vii |
| :v   | :vi  | :i   |
| :v   | :vi  | :ii  |
| :v   | :vi  | :iii |
| :v   | :vi  | :iv  |
| :v   | :vi  | :v   |
| :v   | :vi  | :vi  |
| :v   | :vi  | :vii |
| :v   | :vii | :i   |
| :v   | :vii | :ii  |
| :v   | :vii | :iii |
| :v   | :vii | :iv  |
| :v   | :vii | :v   |
| :v   | :vii | :vi  |
| :v   | :vii | :vii |
| :vi  | :i   | :i   |
| :vi  | :i   | :ii  |
| :vi  | :i   | :iii |
| :vi  | :i   | :iv  |
| :vi  | :i   | :v   |
| :vi  | :i   | :vi  |
| :vi  | :i   | :vii |
| :vi  | :ii  | :i   |
| :vi  | :ii  | :ii  |
| :vi  | :ii  | :iii |
| :vi  | :ii  | :iv  |
| :vi  | :ii  | :v   |
| :vi  | :ii  | :vi  |
| :vi  | :ii  | :vii |
| :vi  | :iii | :i   |
| :vi  | :iii | :ii  |
| :vi  | :iii | :iii |
| :vi  | :iii | :iv  |
| :vi  | :iii | :v   |
| :vi  | :iii | :vi  |
| :vi  | :iii | :vii |
| :vi  | :iv  | :i   |
| :vi  | :iv  | :ii  |
| :vi  | :iv  | :iii |
| :vi  | :iv  | :iv  |
| :vi  | :iv  | :v   |
| :vi  | :iv  | :vi  |
| :vi  | :iv  | :vii |
| :vi  | :v   | :i   |
| :vi  | :v   | :ii  |
| :vi  | :v   | :iii |
| :vi  | :v   | :iv  |
| :vi  | :v   | :v   |
| :vi  | :v   | :vi  |
| :vi  | :v   | :vii |
| :vi  | :vi  | :i   |
| :vi  | :vi  | :ii  |
| :vi  | :vi  | :iii |
| :vi  | :vi  | :iv  |
| :vi  | :vi  | :v   |
| :vi  | :vi  | :vi  |
| :vi  | :vi  | :vii |
| :vi  | :vii | :i   |
| :vi  | :vii | :ii  |
| :vi  | :vii | :iii |
| :vi  | :vii | :iv  |
| :vi  | :vii | :v   |
| :vi  | :vii | :vi  |
| :vi  | :vii | :vii |
| :vii | :i   | :i   |
| :vii | :i   | :ii  |
| :vii | :i   | :iii |
| :vii | :i   | :iv  |
| :vii | :i   | :v   |
| :vii | :i   | :vi  |
| :vii | :i   | :vii |
| :vii | :ii  | :i   |
| :vii | :ii  | :ii  |
| :vii | :ii  | :iii |
| :vii | :ii  | :iv  |
| :vii | :ii  | :v   |
| :vii | :ii  | :vi  |
| :vii | :ii  | :vii |
| :vii | :iii | :i   |
| :vii | :iii | :ii  |
| :vii | :iii | :iii |
| :vii | :iii | :iv  |
| :vii | :iii | :v   |
| :vii | :iii | :vi  |
| :vii | :iii | :vii |
| :vii | :iv  | :i   |
| :vii | :iv  | :ii  |
| :vii | :iv  | :iii |
| :vii | :iv  | :iv  |
| :vii | :iv  | :v   |
| :vii | :iv  | :vi  |
| :vii | :iv  | :vii |
| :vii | :v   | :i   |
| :vii | :v   | :ii  |
| :vii | :v   | :iii |
| :vii | :v   | :iv  |
| :vii | :v   | :v   |
| :vii | :v   | :vi  |
| :vii | :v   | :vii |
| :vii | :vi  | :i   |
| :vii | :vi  | :ii  |
| :vii | :vi  | :iii |
| :vii | :vi  | :iv  |
| :vii | :vi  | :v   |
| :vii | :vi  | :vi  |
| :vii | :vi  | :vii |
| :vii | :vii | :i   |
| :vii | :vii | :ii  |
| :vii | :vii | :iii |
| :vii | :vii | :iv  |
| :vii | :vii | :v   |
| :vii | :vii | :vi  |
| :vii | :vii | :vii |

#+BEGIN_SRC clojure
(def scale-degrees [:i :ii :iii :iv :v :vi :vii])
#+END_SRC

#+BEGIN_SRC clojure
(degrees->pitches scale-degrees :dorian :E3)
#+END_SRC
#+RESULTS:
| 52 | 54 | 55 | 57 | 59 | 61 | 62 |

#+BEGIN_SRC clojure
(def actual-melody [:vi :vii :i+ :_ :vii :_ :i+ :vii :vi :_ :vii :_])
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/actual-melody
#+BEGIN_SRC clojure
(degrees->pitches actual-melody :dorian :E3)
#+END_SRC

#+RESULTS:
| 61 | 62 | 64 | nil | 62 | nil | 64 | 62 | 61 | nil | 62 | nil |


#+BEGIN_SRC clojure
(degrees->pitches [:i :i+ :i- :ii]  :phrygian :C3)
#+END_SRC

#+RESULTS:
| 48 | 60 | 36 | 49 |

#+BEGIN_SRC clojure
(def do-re-mi  [:i :ii :iii])
(degrees->pitches do-re-mi  :ionian :C3)
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/do-re-mi(48 50 52)
