src/post_tonal_overtone/org_files/html-versions/modeling-musical-time.html
<li><a id="orgheadline24"></a>roman numerals as provided by overtone<br  /><div class="outline-text-5" id="text-1-2-3-3">
<div class="org-src-container">

<pre class="src src-clojure">(count (<span style="color: #7CB8BB;">cmb</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>selections [<span style="color: #BFEBBF;">:i</span> <span style="color: #BFEBBF;">:ii</span> <span style="color: #BFEBBF;">:iii</span> <span style="color: #BFEBBF;">:iv</span> <span style="color: #BFEBBF;">:v</span> <span style="color: #BFEBBF;">:vi</span> <span style="color: #BFEBBF;">:vii</span>] 3))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
<td class="org-left">:vii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
<td class="org-left">:i</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
<td class="org-left">:ii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
<td class="org-left">:iii</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
<td class="org-left">:iv</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
<td class="org-left">:v</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
<td class="org-left">:vi</td>
</tr>

<tr>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
<td class="org-left">:vii</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">scale-degrees</span> [<span style="color: #BFEBBF;">:i</span> <span style="color: #BFEBBF;">:ii</span> <span style="color: #BFEBBF;">:iii</span> <span style="color: #BFEBBF;">:iv</span> <span style="color: #BFEBBF;">:v</span> <span style="color: #BFEBBF;">:vi</span> <span style="color: #BFEBBF;">:vii</span>])
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(degrees-&gt;pitches scale-degrees <span style="color: #BFEBBF;">:dorian</span> <span style="color: #BFEBBF;">:E3</span>)
</pre>
</div>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">actual-melody</span> [<span style="color: #BFEBBF;">:vi</span> <span style="color: #BFEBBF;">:vii</span> <span style="color: #BFEBBF;">:i+</span> <span style="color: #BFEBBF;">:_</span> <span style="color: #BFEBBF;">:vii</span> <span style="color: #BFEBBF;">:_</span> <span style="color: #BFEBBF;">:i+</span> <span style="color: #BFEBBF;">:vii</span> <span style="color: #BFEBBF;">:vi</span> <span style="color: #BFEBBF;">:_</span> <span style="color: #BFEBBF;">:vii</span> <span style="color: #BFEBBF;">:_</span>])
</pre>
</div>
<div class="org-src-container">

<pre class="src src-clojure">(degrees-&gt;pitches actual-melody <span style="color: #BFEBBF;">:dorian</span> <span style="color: #BFEBBF;">:E3</span>)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(degrees-&gt;pitches [<span style="color: #BFEBBF;">:i</span> <span style="color: #BFEBBF;">:i+</span> <span style="color: #BFEBBF;">:i-</span> <span style="color: #BFEBBF;">:ii</span>]  <span style="color: #BFEBBF;">:phrygian</span> <span style="color: #BFEBBF;">:C3</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">do-re-mi</span>  [<span style="color: #BFEBBF;">:i</span> <span style="color: #BFEBBF;">:ii</span> <span style="color: #BFEBBF;">:iii</span>])
(degrees-&gt;pitches do-re-mi  <span style="color: #BFEBBF;">:ionian</span> <span style="color: #BFEBBF;">:C3</span>)
</pre>
</div>
</div></li></ol>
</div>
