src/post_tonal_overtone/org_files/multi-part-overtone-tutorial/modeling-musical-time.org
*** set theoretical constructs
#+BEGIN_SRC clojure
(rand-nth set-class/tetrachords)
#+END_SRC

#+RESULTS:
| 0 | 2 | 4 | 7 |

*** reflecting
Thinking in terms of giant lists of numbers, however, may not seem
particularly efficient or natural, depending on how one's musical
brain was trained. The problem of representation in music is about as
hard as it gets while still lending itself to lots of possible
approaches.

Converting back and forth from conventional musical notation to some
form that is more like the kind of data computer languages are written
to manipulate can be arduous.

However, being able to turn manipulations of numbers into things we
can hear is, for this musician, about as fun as math can get. And it's
easy enough to get caught up in the process, and in doing so,
indirectly turn it into an exercise in learning data transformation in
a language like Clojure.

* using probability to control output
** importing into overtone and clojure from .contrib
I have included in my project all the code that I took still extant
from the .contrib library as I could find it and just imported it in
wholesale as a directory in my src folder.

Thus I am able to do the following (getting pathnames just right is
not easy).

#+BEGIN_SRC clojure
(require '[post_tonal_overtone.probability_functions.finite-distributions :as prb])
#+END_SRC

** in overtone
There are several namespaced functions in the overtone.algo code that
are relevant here.
*** algo.chance

 This declaration is not used here, but could be useful when you want
 to remember where you are getting your functions from
 #+BEGIN_SRC clojure
(require '[overtone.algo.chance :as ochance])
 #+END_SRC

 #+RESULTS:
 : nil

 #+BEGIN_SRC clojure
(dir overtone.algo.chance)
;; choose
;; choose-n
;; chosen-from
;; only
;; ranged-rand
;; weighted-choose
 #+END_SRC

**** choose
 #+BEGIN_SRC clojure :results output
(source choose)
 #+END_SRC

 #+RESULTS:
 : (defn choose
 :   "Choose a random element from col."
 :   [col]
 :   (rand-nth col))

 #+BEGIN_SRC clojure
(choose [[0 1 2] [0 1 3] [0 1 4]])
 #+END_SRC

 #+RESULTS:
 | 0 | 1 | 3 |

**** choose-n
 #+BEGIN_SRC clojure :results output
(source choose-n)
 #+END_SRC

 #+RESULTS:
 : (defn choose-n
 :   "Choose n random elements from col."
 :   [n col]
 :   (take n (shuffle col)))

 #+BEGIN_SRC clojure
(choose-n 2 [[0 1 2] [0 1 3] [0 1 4] [0 1 5]])
 #+END_SRC

 #+RESULTS:
 | 0 | 1 | 4 |
 | 0 | 1 | 3 |

**** chosen-from (note, infinite lazy-seq!)
 #+BEGIN_SRC clojure :results output
(source chosen-from)
 #+END_SRC

 #+RESULTS:
 : (defn chosen-from [notes]
 :   (let [num-notes (count notes)]
 :     (repeatedly #(get notes (rand-int num-notes)))))

 #+BEGIN_SRC clojure
(take 10 (chosen-from [0 2 4 5 7 8]))
 #+END_SRC

 #+RESULTS:
 | 7 | 5 | 0 | 8 | 5 | 5 | 5 | 5 | 5 | 5 |

**** only
 #+BEGIN_SRC clojure :results output
(source only)
 #+END_SRC

 #+RESULTS:
 : (defn only
 :   "Take only the specified notes from the given phrase."
 :   ([phrase notes] (only phrase notes []))
 :   ([phrase notes result]
 :    (if notes
 :      (recur phrase
 :             (next notes)
 :             (conj result (get phrase (first notes))))
 :      result)))

 uh,

 #+BEGIN_SRC clojure
(only [0 2 4 5 7 9 11 12 11 9 7 5 4 2 0] [0 4 7])
 #+END_SRC

 #+RESULTS:
 | 0 | 7 | 12 |

 I don't know.
 #+BEGIN_SRC clojure
(only [0 2 4 5 7 9 11 12 11 9 7 5 4 2 0] [0 7])
 #+END_SRC

 #+RESULTS:
 | 0 | 12 |

 AHHHH, uses indices!
 #+BEGIN_SRC clojure
(only [0 2 4 5 7 9 11 12 11 9 7 5 4 2 0] [0 1])
 #+END_SRC

 #+RESULTS:
 | 0 | 2 |

**** ranged-rand
 #+BEGIN_SRC clojure :results output
(source ranged-rand)
 #+END_SRC

 #+RESULTS:
 : (defn ranged-rand
 :   "Returns a random value within the specified range"
 :   [min max]
 :   (scale-range (rand) 0 1 min max))


 #+BEGIN_SRC clojure
(ranged-rand 1 5)
 #+END_SRC

 #+RESULTS:
 : 3.5377276258001573

**** scale-range
 #+BEGIN_SRC clojure :results output
(source scale-range)
 #+END_SRC

 #+RESULTS:
 #+begin_example
(defn scale-range
  "Scales a given input value within the specified input range to a
  corresponding value in the specified output range using the formula:

           (out-max - out-min) (x - in-min)
   f (x) = --------------------------------  + out-min
                    in-max - in-min

"

  [x in-min in-max out-min out-max]
  (+ (/ (* (- out-max out-min) (- x in-min))
        (- in-max in-min))
     out-min))
 #+end_example

 #+BEGIN_SRC clojure
(overtone.algo.scaling/scale-range 13 1 100 0 1)
 #+END_SRC

 #+RESULTS:
 : 4/33

**** weighted-choose
***** code
 #+BEGIN_SRC clojure :results output
(source weighted-choose)
 #+END_SRC

 #+RESULTS:
 #+begin_example
(defn weighted-choose
  "Returns an element from list vals based on the corresponding
  probabilities list. The length of vals and probabilities should be
  similar and the sum of all the probabilities should be 1. It is also
  possible to pass a map of val -> prob pairs as a param.

  The following will return one of the following vals with the
  corresponding probabilities:
  1 -> 50%
  2 -> 30%
  3 -> 12.5%
  4 -> 7.5%
  (weighted-choose [1 2 3 4] [0.5 0.3 0.125 0.075])
  (weighted-choose {1 0.5, 2 0.3, 3 0.125, 4 0.075})"
  ([val-prob-map] (weighted-choose (keys val-prob-map) (vals val-prob-map)))
  ([vals probabilities]
     (when-not (= (count vals) (count probabilities))
       (throw (IllegalArgumentException. (str "Size of vals and probabilities don't match. Got "
                               (count vals)
                               " and "
                               (count probabilities)))))
     (when-not (= (reduce + probabilities) 1.0)
       (throw (IllegalArgumentException. (str "The sum of your probabilities is not 1.0"))))

     (let [paired (map vector probabilities vals)
           sorted (sort #(< (first %1) (first %2)) paired)
           summed (loop [todo sorted
                         done []
                         cumulative 0]
                    (if (empty? todo)
                      done
                      (let [f-prob (ffirst todo)
                            f-val  (second (first todo))
                            cumulative (+ cumulative f-prob)]
                        (recur (rest todo)
                               (conj done [cumulative f-val])
                               cumulative))))
           rand-num (rand)]
       (loop [summed summed]
         (when (empty? summed)
           (throw (Exception. (str "Error, Reached end of weighed choice options"))))
         (if (< rand-num (ffirst summed))
           (second (first summed))
           (recur (rest summed)))))))
 #+end_example

 #+END_SRC

***** examples
#+BEGIN_SRC clojure
(weighted-choose [1 2 3 4] [0.5 0.3 0.125 0.075])
#+END_SRC

#+RESULTS:
: 2
#+BEGIN_SRC clojure
(weighted-choose {1 0.5, 2 0.3, 3 0.125, 4 0.075})
#+END_SRC

#+RESULTS:
: 1

#+BEGIN_SRC clojure
(take 20 (repeatedly #(weighted-choose {1 0.5, 2 0.3, 3 0.125, 4 0.075})))
#+END_SRC

#+RESULTS:
| 3 | 3 | 2 | 2 | 2 | 3 | 1 | 1 | 1 | 1 | 1 | 3 | 2 | 1 | 1 | 3 | 4 | 1 | 2 | 1 |

#+BEGIN_SRC clojure
(repeatedly 10 #(let [e1 (weighted-choose [1 2 3 4] [0.25 0.25 0.25 0.25])]
  (case e1
    1 (weighted-choose [1 2 3 4] (rotate 0 [0.8 0.1 0.05 0.05]))
    2 (weighted-choose [1 2 3 4] (rotate 1 [0.8 0.1 0.05 0.05]))
    3 (weighted-choose [1 2 3 4] (rotate 2 [0.8 0.1 0.05 0.05]))
    4 (weighted-choose [1 2 3 4] (rotate 3 [0.8 0.1 0.05 0.05])))))
#+END_SRC

#+RESULTS:
| 1 | 4 | 2 | 2 | 3 | 2 | 3 | 4 | 1 | 4 |

