src/post_tonal_overtone/org_files/html-versions/modeling-musical-time.html
<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">1.2.4</span> set theoretical constructs</h4>
<div class="outline-text-4" id="text-1-2-4">
<div class="org-src-container">

<pre class="src src-clojure">(rand-nth <span style="color: #7CB8BB;">set-class</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>tetrachords)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">1.2.5</span> reflecting</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Thinking in terms of giant lists of numbers, however, may not seem
particularly efficient or natural, depending on how one's musical
brain was trained. The problem of representation in music is about as
hard as it gets while still lending itself to lots of possible
approaches.
</p>

<p>
Converting back and forth from conventional musical notation to some
form that is more like the kind of data computer languages are written
to manipulate can be arduous.
</p>

<p>
However, being able to turn manipulations of numbers into things we
can hear is, for this musician, about as fun as math can get. And it's
easy enough to get caught up in the process, and in doing so,
indirectly turn it into an exercise in learning data transformation in
a language like Clojure.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline44" class="outline-2">
<h2 id="orgheadline44"><span class="section-number-2">2</span> using probability to control output</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">2.1</span> importing into overtone and clojure from .contrib</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I have included in my project all the code that I took still extant
from the .contrib library as I could find it and just imported it in
wholesale as a directory in my src folder.
</p>

<p>
Thus I am able to do the following (getting pathnames just right is
not easy).
</p>

<div class="org-src-container">

<pre class="src src-clojure">(require '[<span style="color: #7CB8BB;">post_tonal_overtone.probability_functions.finite-distributions</span> <span style="color: #BFEBBF;">:as</span> prb])
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline42" class="outline-3">
<h3 id="orgheadline42"><span class="section-number-3">2.2</span> in overtone</h3>
<div class="outline-text-3" id="text-2-2">
<p>
There are several namespaced functions in the overtone.algo code that
are relevant here.
</p>
</div>
<div id="outline-container-orgheadline40" class="outline-4">
<h4 id="orgheadline40"><span class="section-number-4">2.2.1</span> algo.chance</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
This declaration is not used here, but could be useful when you want
to remember where you are getting your functions from
</p>
<div class="org-src-container">

<pre class="src src-clojure">(require '[<span style="color: #7CB8BB;">overtone.algo.chance</span> <span style="color: #BFEBBF;">:as</span> ochance])
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(dir <span style="color: #7CB8BB;">overtone.algo.chance</span>)
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">choose</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">choose-n</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">chosen-from</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">only</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">ranged-rand</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">weighted-choose</span>
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="orgheadline31"></a>choose<br  /><div class="outline-text-5" id="text-2-2-1-1">
<div class="org-src-container">

<pre class="src src-clojure">(source choose)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(choose [[0 1 2] [0 1 3] [0 1 4]])
</pre>
</div>
</div></li>

<li><a id="orgheadline32"></a>choose-n<br  /><div class="outline-text-5" id="text-2-2-1-2">
<div class="org-src-container">

<pre class="src src-clojure">(source choose-n)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(choose-n 2 [[0 1 2] [0 1 3] [0 1 4] [0 1 5]])
</pre>
</div>
</div></li>

<li><a id="orgheadline33"></a>chosen-from (note, infinite lazy-seq!)<br  /><div class="outline-text-5" id="text-2-2-1-3">
<div class="org-src-container">

<pre class="src src-clojure">(source chosen-from)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(take 10 (chosen-from [0 2 4 5 7 8]))
</pre>
</div>
</div></li>

<li><a id="orgheadline34"></a>only<br  /><div class="outline-text-5" id="text-2-2-1-4">
<div class="org-src-container">

<pre class="src src-clojure">(source only)
</pre>
</div>

<p>
uh,
</p>

<div class="org-src-container">

<pre class="src src-clojure">(only [0 2 4 5 7 9 11 12 11 9 7 5 4 2 0] [0 4 7])
</pre>
</div>

<p>
I don't know.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(only [0 2 4 5 7 9 11 12 11 9 7 5 4 2 0] [0 7])
</pre>
</div>

<p>
AHHHH, uses indices!
</p>
<div class="org-src-container">

<pre class="src src-clojure">(only [0 2 4 5 7 9 11 12 11 9 7 5 4 2 0] [0 1])
</pre>
</div>
</div></li>

<li><a id="orgheadline35"></a>ranged-rand<br  /><div class="outline-text-5" id="text-2-2-1-5">
<div class="org-src-container">

<pre class="src src-clojure">(source ranged-rand)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(ranged-rand 1 5)
</pre>
</div>
</div></li>

<li><a id="orgheadline36"></a>scale-range<br  /><div class="outline-text-5" id="text-2-2-1-6">
<div class="org-src-container">

<pre class="src src-clojure">(source scale-range)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #7CB8BB;">overtone.algo.scaling</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>scale-range 13 1 100 0 1)
</pre>
</div>
</div></li>

<li><a id="orgheadline39"></a>weighted-choose<br  /><ol class="org-ol"><li><a id="orgheadline37"></a>code<br  /><div class="outline-text-6" id="text-2-2-1-7-1">
<div class="org-src-container">

<pre class="src src-clojure">(source weighted-choose)
</pre>
</div>

<p>
#+END<sub>SRC</sub>
</p>
</div></li>

<li><a id="orgheadline38"></a>examples<br  /><div class="outline-text-6" id="text-2-2-1-7-2">
<div class="org-src-container">

<pre class="src src-clojure">(weighted-choose [1 2 3 4] [0.5 0.3 0.125 0.075])
</pre>
</div>
<div class="org-src-container">

<pre class="src src-clojure">(weighted-choose {1 0.5, 2 0.3, 3 0.125, 4 0.075})
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(take 20 (repeatedly #(weighted-choose {1 0.5, 2 0.3, 3 0.125, 4 0.075})))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(repeatedly 10 #(<span style="color: #F0DFAF; font-weight: bold;">let</span> [e1 (weighted-choose [1 2 3 4] [0.25 0.25 0.25 0.25])]
  (<span style="color: #F0DFAF; font-weight: bold;">case</span> e1
    1 (weighted-choose [1 2 3 4] (rotate 0 [0.8 0.1 0.05 0.05]))
    2 (weighted-choose [1 2 3 4] (rotate 1 [0.8 0.1 0.05 0.05]))
    3 (weighted-choose [1 2 3 4] (rotate 2 [0.8 0.1 0.05 0.05]))
    4 (weighted-choose [1 2 3 4] (rotate 3 [0.8 0.1 0.05 0.05])))))
</pre>
</div>
</div></li></ol></li></ol>
</div>
