src/post_tonal_overtone/org_files/multi-part-overtone-tutorial/modeling-musical-time.org
*** overtone.algo.fn

#+BEGIN_SRC clojure :results output
(doc cycle-fn)
#+END_SRC

#+RESULTS:
#+begin_example
-------------------------
overtone.live/cycle-fn
([& fns])
  Returns a fn which will cycle between each of the fns specified. The
   first time the fn is called, the first fn in fns will be called, the
   second time, the second fn in fns etc, cycling around indefinitely.

   The args passed into the returned fn will be passed through to the
   appropriate inner fn. Additionally, the result of the inner fn will
   be returned as the result of the outer fn.

   Will catch any exceptions generated by the internal fns and print a
   stacktrace to stdout.

   (def f (cycle-fn (fn [st] (println "hi" st))
                    (fn [st] (println "yo" st))
                    (fn [st] (println "ho ho" st))))

   (f "there") ;=> "hi there"
   (f "bro")   ;=> "yo bro"
   (f "santa") ;=> "ho ho santa"
   (f "again") ;=> "hi again"
#+end_example

** from other clojure libraries
There was a library in clojure.contrib for working with probability,
namely the .probabilities.finite-distributions library by Konrad
Hinsen, which became largely deprecated with the move away from
.contrib. 

It makes heavy use of monands, and the contrib.monands library, which
poses some problems of usability for the average user.

#+BEGIN_SRC clojure
(dir post_tonal_overtone.probability_functions.finite-distributions)
bernoulli
binomial
certainly
choose
cond-dist-m
cond-prob
dist-m
join-with
make-distribution
normalize
normalize-cond
prob
select
uniform
zipf
nil
#+END_SRC
* divisions and subdivisions
** messing around with numbers
#+BEGIN_SRC clojure
(repeat 4 1)
#+END_SRC

#+RESULTS:
| 1 | 1 | 1 | 1 |

#+BEGIN_SRC clojure
(for [n (range 4 -1 -1)]
  (repeat n n))
#+END_SRC

#+RESULTS:
| 4 | 4 | 4 | 4 |
| 3 | 3 | 3 |   |
| 2 | 2 |   |   |
| 1 |   |   |   |


| 1 |   4 |
| 2 |   2 |
| 3 | 4/3 |
| 4 |   1 |

(= 4 (* 3 n)

| 1 |   64 |
| 2 |   32 |
| 3 | 64/3 |
| 4 |   16 |
| 5 |      |

