src/post_tonal_overtone/org_files/html-versions/modeling-musical-time.html

<div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41"><span class="section-number-4">2.2.2</span> overtone.algo.fn</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">

<pre class="src src-clojure">(doc cycle-fn)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">2.3</span> from other clojure libraries</h3>
<div class="outline-text-3" id="text-2-3">
<p>
There was a library in clojure.contrib for working with probability,
namely the .probabilities.finite-distributions library by Konrad
Hinsen, which became largely deprecated with the move away from
.contrib. 
</p>

<p>
It makes heavy use of monands, and the contrib.monands library, which
poses some problems of usability for the average user.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(dir <span style="color: #7CB8BB;">post_tonal_overtone.probability_functions.finite-distributions</span>)
bernoulli
binomial
certainly
choose
cond-dist-m
cond-prob
dist-m
join-with
make-distribution
normalize
normalize-cond
prob
select
uniform
zipf
<span style="color: #BFEBBF;">nil</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline46" class="outline-2">
<h2 id="orgheadline46"><span class="section-number-2">3</span> divisions and subdivisions</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45"><span class="section-number-3">3.1</span> messing around with numbers</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-clojure">(repeat 4 1)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">for</span> [n (range 4 -1 -1)]
  (repeat n n))
</pre>
</div>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">4/3</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<p>
(= 4 (* 3 n)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">32</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">64/3</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">16</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: b</p>
<p class="date">Created: 2016-12-02 Fri 15:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
